//data
var Data = {
    "app-name": "آموزش آشپزی فلفل",
    "app-version": "1.0.0",
    "item": [
        {
            "ID": "1",
            "name": "خورش قرمه سبزی",
            "shortDescription": "خورش قرمه سبزی یکی از شناخته شده ترین خورش های ایرانی است که اصالتا متعلق به مناطقی نزدیک به آذربایجان می باشد. خورش قرمه سبزی از متداول ترین غذاهای سفره های ایرانی است و طرفداران زیادی در بین تمامی اقشار دارد. در ادامه با طرز تهیه خورش قرمه سبزی آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> سبزی قرمه </li> <li > یک کیلو </li>" +
            "<li> گوشت مغز ران گوسفند یا ماهیچه </li> <li > ۷۵۰ گرم </li>" +
            "<li> لوبیا قرمز </li> <li > نصف پیمانه </li>" +
            "<li> پیاز سرخ شده </li> <li > ۳ عدد </li>" +
            "<li> روغن </li> <li > یک پیمانه </li>" +
            "<li> گرد لیمو </li><li > دو قاشق سوپ خوری </li>" +
            "</ul>",
            "images": [
                "1-1.jpg",
                "1-2.jpg"
            ],
            "howTo":
            "<b class='text-danger'> گام اول: </b>" +
            "ابتدا پیازها را خرد کنید و در روغن تفت دهید. بعد از آن باید گوشت را تکه تکه کنید و و به تابه اضافه نمایید. گوشت ها باید آنقدر سرخ شوند تا آب گوشت کاملا چیده شود." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "اکنون نوبت اضافه کردن زردچوبه، فلفل و ۲ الی ۳ لیوان آب جوش به خورش است." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "لوبیا قرمزهایی را که از شب قبل خیس کرده اید را داخل خورش بریزید و بگذارید تا نیم پز شود." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "سبزی قرمه را باید از قبلا بشویید، ریز کنید و خوب سرخ نمایید. سبزی ها را در این مرحله داخل خورش بریزید و بگذارید خورش قرمه سبزی با حرارت کم بپزد و جا بیافتد." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "دو دقیقه آخر گرد لیمو عمانی را به خورش اضافه کنید. در صورت تمایل می توانید کمی زعفران نیز به خورش قرمه سبزی خود اضافه نمایید." +
            "<br>" +
            "<b class='text-danger'> نکته:</b>" +
            "می توانید بجای گرد لیمو از ۶ عدد لیموی عمانی درسته استفاده نمایید." +
            "<br>" +
            "امیدورام تجربه لذت بخشی را از تهیه خورش قرمه سبزی داشته باشید."
        },
        {
            "ID": "2",
            "name": "آش شله قلمکار",
            "shortDescription": "آش شله قلمکار یکی از معروف ترین آش های ایرانی ست. آش شله قلمکار بدلیل وجود گوشت، انواع سبزیجات و انواع حبوبات یکی از مقوی ترین غذاهاست. در ادامه با طرز تهیه آش شله قلمکار آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> لوبیا چشم بلبلی </li><li > نصف پیمانه </li>" +
            "<li> لوبیا سفید </li><li > نصف پیمانه </li>" +
            "<li> لوبیا چینی </li> <li > نصف پیمانه </li>" +
            "<li> لوبیا قرمز </li><li > نصف پیمانه </li>" +
            "<li> نخود </li><li > نصف پیمانه </li>" +
            "<li> عدس </li> <li > دو پیمانه </li>" +
            "<li> گوشت گردن یا سردست </li><li > یک و نیم کیلو </li>" +
            "<li> برنج </li> <li > یک و نیم پیمانه </li>" +
            "<li> پیاز سرخ شده </li> <li > سه پیمانه </li>" +
            "<li> روغن </li> <li > به مقدار لازم </li>" +
            "<li> نمک و فلفل و ادویه و زردچوبه </li> <li > به مقدار لازم </li>" +
            "<li> نعناع داغ </li> <li > به میزان لازم </li>" +
            "<li> تره ، شوید ، جعفری، گشنیز ، اسفناج </li> <li > یک و نیم تا دو کیلو </li>" +
            "<li> جو بلغور </li><li >یک و نیم پیمانه </li>" +
            "</ul>",
            "images": [
                "2-1.jpg",
                "2-2.jpg"
            ],
            "howTo":
            "<b class='text-danger'> گام اول: </b>" +
            "سبزی آش را تمیز نموده، بشویید و سپس خرد نمایید. حبوباتی را که از روز قبل خیس کرده اید را نیز بپزید." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "برنج را باید چند ساعت قبل از پخت، خیس کنید. در ظرف بزرگی آب را جوش بیاورید و برنج و سبزی را داخل آن بپزید." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "گوشت را خوب بپزید و سپس بکوبید تا کاملا کش دار شود." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "پس از پخته شدن برنج و سبزی، حبوبات را نیز به آن بیافزایید و با حرارت ملایم بپزید تا حبوبات کاملا له و پخته شوند." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "اکنون موقع آن است که گوشت را اضافه کنید و بگذارید آش شله قلمکار با حرارت کم بپزد. فراموش نکنید که باید مرتب آن را هم بزنید." +
            "<br>" +
            "<b class='text-danger'> گام ششم: </b>" +
            "ادویه جات را در روغن تفت دهید و به آش شله قلمکار اضافه نمایید. نیمی از پیاز داغ را نیز در این مرحله به آش اضافه کنید. کمی نمک به آش اضافه کنید و با حرارت کم بگذارید تا آش جا بیافتد." +
            "<br>" +
            "<b class='text-danger'> گام هفتم: </b>" +
            "آش شله قلمکار آماده است. آن را در ظرف زیبایی بریزید و روی آن را با نعناع و پیاز داغ تزیین کنید." +
            "<br>" +
            "امیدوارم اوقات لذت بخشی را از تهیه آش شله قلمکار تجربه کرده باشید."

        },
        {
            "ID": "3",
            "name": "خورش فسنجان",
            "shortDescription": "خورش فسنجان یکی از محبوب ترین خورش های ایرانی است که با گردو و رب انار تهیه می شود. خورش فسنجان در طیف های مختلف شیرین و ترش و با گوشت قرمز و گوشت مرغ تهیه می شود. در ادامه با طرز تهیه خورش فسنجان آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> گوشت چرخ کرده </li><li> 350 گرم + یک پیاز متوسط </li>" +
            "<li> یا </li><li> - </li>" +
            "<li> مرغ </li><li> یک عدد - یک و نیم کیلو </li>" +
            "<li> مغز گردوی چرخ کرده </li><li> سه پیمانه </li>" +
            "<li> پیاز رنده و سرخ شده </li><li> دو عدد متوسط </li>" +
            "<li> رب انار </li><li> دو سوم پیمانه </li>" +
            "<li> شکر </li><li> در صورت تمایل </li>" +
            "<li> نمک </li><li> کمی </li>" +
            "</ul>",
            "images": [
                "3-1.jpg",
                "3-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "پیاز را ابتدا رنده و سپس سرخ کنید. گردوی چرخ شده را به آن بیافزایید و کمی تفت دهید. آب را ب همراه نمک و فلفل اضافه کنید و بگذارید بپزد. توجه داشته باشید که درب ظرف باید نیمه بسته و خورش باید با حرارت ملایم و آهسته پخته شود." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام دوم: </b>" +
            "" +
            "گوشت چرخ کرده را به همراه پیاز رنده شده و کمی نمک خوب ورز دهید و از آن کوفته ریزه تهیه نمایید." +
            "توجه داشته باشید که در صورت استفاده از مرغ، باید آن را به قطعات ۱۰ تایی تقسیم کنید و در کمی روغن تفت دهید. ضمنا در این حالت، مرغ باید در اواسط طبخ اضافه گردد." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام سوم: </b>" +
            "حرارت زیر خورش باید کم باشد تا خورش فسنجان کاملا به روغن بیافتد." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "پس از به روغن افتادن خورش فسنجان، رب انار را اضافه کنید و بگذارید ده دقیقه دیگر بپزد. در صورت تمایل کمی شکر به خورش فسنجان اضافه نمایید." +
            "<br>" +
            "" +
            "امیدوارم تجربه لذت بخشی را از تهیه خورش فسنجان داشته باشید."
        },
        {
            "ID": "4",
            "name": "خورش کرفس",
            "shortDescription": "خورش کرفس یکی از محبوب ترین و رایج ترین خورش های ایرانی است که در بسیاری از خانه های ایرانی استفاده می شود. خورش کرفس تقریبا در تمامی فصول مصرف می شود و هواداران زیادی دارد. در ادامه با طرز تهیه خورش کرفس آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> گوشت ماهیچه </li><li> یک کیلو </li>" +
            "<li> کرفس </li><li>دو شاخه </li>" +
            "<li> پیاز سرخ شده </li><li> سه عدد </li>" +
            "<li> نعنا و جعفری </li><li> یک کیلو </li>" +
            "<li> آبلیمو </li><li> به میزان لازم</li>" +
            "<li> زعفران </li><li> یک قاشق چای خوری </li>" +
            "<li> روغن </li><li> یک پیمانه </li>" +
            "<li> نمک و فلفل </li><li> به میزان لازم </li>" +
            "</ul>",
            "images": [
                "4-1.jpg",
                "4-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "ابتدا پیاز را خرد کرده و تفت دهید." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام دوم: </b>" +
            "گوشت را به قطعات ۳ در ۳ خرده کنید و در پیاز تفت دهید تا آب آن چیده شود." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام سوم: </b>" +
            "شاخه های ترد و سفید کرفس را که قبلا خرد و سرخ شده (به اندازه دو بند انگشت) به همراه نعنا و جعفری به مواد بالا بیافزایید و بگذارید تا خورش به روغن بیافتد." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "در نهایت آبلیمو و زعفران به خورش اضافه کنید. خورش کرفس را در ظرفی زیبا به همراه چلو سرو نمایید." +
            "<br>" +
            "" +
            "امیدوارم تجربه لذت بخشی را از تهیه خورش کرفس داشته باشید."
        },
        {
            "ID": "5",
            "name": "میرزا قاسمی",
            "shortDescription": "میرزا قاسمی یکی از غذاهای گیلانی است که از بادمجان کبابی تهیه می شود. میرزا قاسمی یکی از محبوب ترین غذاها بین تمامی مناطق جغرافیایی ایران است. در ادامه طرز تهیه میرزاقاسمی را خواهید دید.",
            "ingredients": "<ul>" +
            "<li> بادمجان متوسط </li><li>۱۰ عدد</li>" +
            "<li> سیر </li><li>۲ بوته</li>" +
            "<li> روغن </li><li>۲۰۰ گرم</li>" +
            "<li> تخم مرغ </li><li>۳-۵ عدد</li>" +
            "<li> گوجه فرنگی </li><li> ۲ عدد</li>" +
            "<li> رب گوجه </li><li>یک قاشق سوپ خوری</li>" +
            "</ul>",
            "images": [
                "5-1.jpg",
                "5-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "بادمجانها را روی آتش یا درون فر، کبابی کنید تا کاملا برشته شود. بعد پوست آنها را بگیرید و سر آنها را نیز جدا کنید. گوشت بادمجان ها را خارج کنید و سپس بادمجان ها را ساطوری نمایید." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام دوم: </b>" +
            "گوجه فرنگی ها را در آب جوش بیاندازید و پس از کندن پوست، آنها را بصورت ریز خرد کنید." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام سوم: </b>" +
            "گوجه خرد شده و سیر کوبیده را در روغن سرخ نمایید" +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "بادمجان های ساطوری شده را سرخ کنید. سپس گوجه و سیر را به آن بیافزایید و دوباره سرخ کنید تا آب آن تبخیر شود و روغن بیافتد." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "کمی نمک و فلفل به غذا اضافه کنید و تخم مرغ ها را با فاصله درون تابه بریزید تا بسته شود." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام ششم: </b>" +
            "میرزا قاسمی آماده است. آن را در دیس سرو کنید و اطراف آن را با سیر خام و گوجه فرنگی تزیین نمایید." +
            "<br>" +
            "" +
            "امیدوارم از تجربه تهیه میرزا قاسمی لذت برده باشید."
        },
        {
            "ID": "6",
            "name": "کوفته برنجی",
            "shortDescription": "کوفته برنجی از غذاهای اصیل و پرطرفدار ایرانی است. این کوفته از ترکیب گوشت، برنج و سبزیجات تهیه می شود. کوفته برنجی در هر یک از شهرهای ایران بر طبق سبزیجات محلی همان منطقه تهیه می شود بنابر این کوفته برنجی هر منطقه دارای طعمی منحصر به فرد می باشد. درون کوفته برنجی می توانید از گردو، آلو بخارا و زشک استفاده نمایید. در ادامه با طرز تهیه کوفته برنجی آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> گوشت دوبار چرخ شده </li><li>نیم کیلو</li>" +
            "<li> برنج </li><li> ۱ پیمانه </li>" +
            "<li> لپه </li><li> یک دوم پیمانه </li>" +
            "<li> تخم مرغ </li><li> ۱ الی ۲ عدد </li>" +
            "<li> سبزی معطر دلمه خرد شده </li><li> ۱۵۰ گرم </li>" +
            "<li> پیاز رنده و آبگرفته </li><li> ۲ عدد </li>" +
            "<li> آرد نخودچی </li><li>۱ الی ۲ قاشق سوپخوری</li>" +
            "<li> فلفل سیاه و ادویه </li><li>هر کدام ۱ قاشق چایخوری</li>" +
            "<li> زردچوبه و ادویه کاری </li><li> هر کدام ۱ قاشق چایخوری </li>" +
            "<li> زعفران دم کرده </li><li> ۱ قاشق سوپخوری</li>" +

            "<li > سس کوفته برنجی </li><li>به میزان لازم </li>" +
            "<li> پیاز خرد شده و سرخ شده </li><li>۲ عدد</li>\"" +
            "<li> رب گوجه فرنگی </li><li> یک چهارم پیمانه </li>" +
            "<li> آب </li><li>۲ لیتر</li>" +
            "<li> روغن سرخ کردنی </li><li>به میزان لازم </li>" +
            "</ul>",
            "images": [
                "6-1.jpg",
                "6-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "برنج و لپه را بصورت جداگانه خیس کنید و پس از چند ساعت آنها را بپزید و در صافی بریزید تا آب اضافی آن گرفته شود. در نهایت آن را چرخ کنید." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام دوم: </b>" +
            "گوشت دوبار چرخ شده، پیاز رنده شده و آب گرفته، ادویه جات، لپه، برنج چرخ شده، آرد نخودچی و یک عدد تخم مرغ را اضافه کنید. تمام مواد را خوب ماساژ دهید تا مایه کوفته برنجی کاملا چسبناک شود." +
            "<br>" +
            "" +
            "<b class='text-danger'> گام سوم: </b>" +
            "مواد کوفته برنجی را به مدت ۱ ساعت در یخچال استراحت دهید. بعد از این مدت چنانچه مایه کوفته شل بود یکی دو قاشق آرد نخودچی و اگر سفت بود یک تخم مرغ به آن اضافه کنید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "در این مرحله باید سس کوفته را آماده کنید. برای این منظور ۲ عدد پیاز ریز خرد شده را در روغن تفت دهید و سپس رب گوجه و ادویه را به آن اضافه نمایید و کمی تفت دهید. ۲ لیتر آب به سس کوفته اضافه کنید. زعفران را نیز باید در همین مرحله به سس اضافه کنید. بگذارید تا سس کوفته جوش بیاید." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "گلوله هایی به اندازه نارنگی از مایه کوفته بردارید و درون سس جوشان قرار دهید. کوفته ها باید به مدت ۱ ساعت با درب نیمه باز و حرارت ملایم بپزند." +
            "<br>" +
            "<b class='text-danger'> گام ششم: </b>" +
            "کوفته برنجی شما آماده شده است. کوفته ها را در ظرف مناسبی بچینید و سس کوفته را روی آن بریزید." +
            "<br>" +
            "امیدوارم از تهیه کوفته برنجی لذت برده باشید."
        },
        {
            "ID": "7",
            "name": "کوفته تبریزی",
            "shortDescription": "یکی از غذاهای معروف و اصیل ایرانی کوفته تبریزی است. کوفته تبریزی غذایی از خطه آذربایجان و منتسب به شهر تبریز است. کوفته تبریزی بسیار لذیذ و در میان ایرانیان بسیار پرطرفدار است. برخلاف آنچه ممکن است بنظر بیاید، اگر به چند نکته کلیدی توجه داشته باشید تهیه این کوفته ساده و راحت خواهد بود. سبزی کوفته تبریزی شامل: مرزه، ترخون، گشنیز،‌ جعفری، نعناع و شوید می باشد. مواد میانی این کوفته می تواند شامل تخم مرغ پخته، آلو بخارا، زرشک، گردو و پیاز سرخ شده باشد و یکی از دلایل خوشمزه بودن این غذا حضور همین مواد میانی است. در ادامه با طرز تهیه کوفته تبریزی آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> گوشت دوبار چرخ شده </li><li> ۵۰۰ گرم </li>" +
            "<li> لپه </li><li> ۲ پیمانه </li>" +
            "<li> برنج </li><li> یک دوم پیمانه </li>" +
            "<li> سیب زمینی پخته </li><li> ۱ عدد</li>" +
            "<li> تخم مرغ </li><li> ۱ عدد </li>" +
            "<li> سبزی کوفته خرد شده </li><li> ۲۵۰ الی ۳۰۰ گرم </li>" +
            "<li> زعفران دم کرده </li><li> ۱ قاشق سوپخوری </li>" +
            "<li> رب گوجه فرنگی </li><li>یک چهارم پیمانه </li>" +
            "<li> نمک و فلفل سیاه </li><li> به میزان لازم </li>" +
            "<li> زردچوبه و ادویه کاری </li><li> به میزان لازم </li>" +
            "<li> آرد نخودچی </li><li> ۲ قاشق سوپخوری </li>" +
            "<li> پیاز </li><li> ۲ عدد </li>" +
            "</ul><div class='clearfix'></div>" +
            "<ul>" +
            "<li><b style=\"font-size:20px;\"> مواد میانی کوفته: </b></li>" +
            "<li> تخم مرغ پخته </li>" +
            "<li> گردو نگینی خرد شده </li>" +
            "<li> آلو بخار </li>" +
            "<li> زرشک </li>" +
            "<li> پیاز سرخ شده </li>" +
            "</ul>",
            "images": [
                "7-1.jpg",
                "7-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "لپه و برنج را از ۲ تا ۳ ساعت قبل با مقداری آب خیس کنید و بعد بپزید و در صافی بریزید تا آب اضافی آن گرفته شود." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "سیب زمینی را با مقداری آب بپزید. پوست آن را بگیرید و درحالی که گرم است رنده کنید." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "پیاز را ریز رنده کنید و آب آن را بگیرید. سپس آن را با گوشت چرخ کرده و ادویه جات مخلوط کنید و ماساژ دهید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "لپه، برنج،‌ سیب زمینی،‌ نمک و فلفل و یک عدد تخم مرغ را به مواد گوشتی اضافه کنید و خوب ورز دهید تا مایه کوفته کاملا چسبناک شود. مایه کوفته تبریزی را ۱ ساعت در یخچال قرار دهید." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "در صورت شل بودن مایه کوفته، ۲ قاشق آرد نخودچی و در صورت سفت بودن ۱ عدد تخم مرغ به آن اضافه کنید." +
            "<br>" +
            "<b class='text-danger'> گام ششم: </b>" +
            "به اندازه یک پرتقال از مایه کوفته بردارید و گرد کنید. وسط آن را یک تخم مرغ پخته، زرشک، گردو و پیاز تفت داده شده بگذارید و در دست گرد کنید." +
            "<br>" +
            "<b class='text-danger'> گام هفتم: </b>" +
            "در این مرحله باید سس کوفته را آماده کنید. برای این منظور ۱ عدد پیاز را ریز خرد کنید و در مقداری روغن تفت دهید. سپس رب گوجه فرنگی، ‌ادویه و زردچوبه را به آن بیافزایید و کمی تفت دهید. در نهایت ۱ الی ۲ لیتر آب به سس اضافه کنید و بگذارید به جوش بیاید." +
            "<br>" +
            "<b class='text-danger'> گام هشتم: </b>" +
            "کوفته ها را به آرامی درون سس قرار دهید. میزان سس باید به قدری باشد که روی کوفته ها را بگیرد. کوفته تبریزی باید به مدت ۱ ساعت با درب نیمه باز بپزد." +
            "<br>" +
            "<b class='text-danger'> گام نهم: </b>" +
            "پس از اتمام پخت، کوفته ها را درون ظرفی زیبا به همراه مقداری سس کوفته سرو کنید." +
            "<br>" +
            "امیدوارم از تهیه کوفته تبریزی لذت برده باشید."
        },
        {
            "ID": "8",
            "name": "هویج پلو",
            "shortDescription": "هویج پلو یکی از قدیمی ترین پلوهای ایرانی است. هویج پلو بدلیل ماهیت شیرین هویج، ممکن است برخی افراد را از خود دور کند اما بسیاری از افراد طعم خاص آنرا دوست دارند. در ادامه طرز تهیه هویج پلو را خواهید دید.",
            "ingredients": "<ul>" +
            "<li> برنج </li><li>۵ پیمانه</li>" +
            "<li> مرغ </li><li> ۱ کیلو</li>" +
            "<li> پیاز </li><li> ۱ عدد</li>" +
            "<li> هویج خلال شده </li><li> ۵۰۰ گرم</li>" +
            "<li> خلال پوست پرتقال</li><li> یک دوم پیمانه </li>" +
            "<li> زعفران دمکرده </li><li> ۳ قاشق سوپ خوری </li>" +
            "<li> روغن </li><li> یک دوم پیمانه </li>" +
            "</ul>",
            "images": [
                "8-1.jpg",
                "8-2.jpg"
            ],
            "howTo":
            "<b class='text-danger'> گام اول: </b>" +
            "برنج را پاک کرده، بشویید و حدود ۵ ساعت خیس کنید." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "مرغ را بشویید و باز پیاز و آب بپزید. کمی زعفران به آن اضافه نمایید و بگذارید آب آن گرفته شود." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "هویج خلالی را با کمی روغن تفت دهید تا نیم پز شود. سپس خلال پرتقال شیرین شده را به آن بیفزایید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "بعد از انجام مراحل بالا برنج را آبکش کنید. کف قابلمه را کمی روغن بریزید و سیب زمینی های ورقه ای را یا نان لواش بگذارید. خلال هویج و پرتقال &nbsp;را لا به لای برنج بریزید. کمی زعفران دم کرده و روغن نیز روی برنج بریزید. درب قابلمه را بگذارید و برنج را دم کنید." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "پس از پخت برنج آن را در یک ظرف زیبا و بزرگ ریخته و سرو نمایید." +
            "<br>" +
            "امیدوارم تجربه لذت بخشی را از تهیه هویج پلو داشته باشید."
        },
        {
            "ID": "9",
            "name": "آلبالو پلو",
            "shortDescription": "آلبالو پلو یکی از غذاهای سنتی است که در ایران طرفداران بسیاری دارد. در صورتی که از آلبالوی تازه استفاده کنید می توانید یکی از خوش طعم ترین غذاهای خانگی را تهیه نمایید.آلبالو پلو بین افراد شیرین پسند، محبوبیت بیشتری دارد. البته آلبالو پلو را می توان بصورت ملس نیز تهیه نمود. در ادامه با طرز تهیه آلبالو پلو آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> برنج </li><li> ۵ پیمانه </li>" +
            "<li> آلبالو </li><li> ۵۰۰ گرم </li>" +
            "<li> گوشت چرخ کرده </li><li>۳۰۰ گرم</li>" +
            "<li> شکر </li><li> ۲۵۰ الی ۳۰۰ گرم </li>" +
            "<li> پیاز </li><li>۱ عدد</li>" +
            "<li> زعفران دم کرده </li><li>۵ قاشق سوپخوری</li>" +
            "<li> نمک و فلفل </li><li>به میزان لازم</li>" +
            "<li> دارچین و زردچوبه </li><li> به میزان لازم </li>" +
            "<li> روغن </li><li>به میزان لازم</li>" +
            "<li> کره </li><li>۵۰ گرم</li>" +
            "</ul>",
            "images": [
                "9-1.jpg",
                "9-2.jpg"
            ],
            "howTo":
            "<b class='text-danger'> گام اول: </b>" +
            "ابتدا باید چوب و هسته آلبالو ها را جدا کنید. سپس لا به لای آلبالو شکر بپاشید و آن را روی حرارت متوسط قرار دهید تا بپزد اما آلبالوها له نشوند." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "پیاز را بصورت ریز رنده کنید و پس از گرفتن مقداری از آب آن را با نمک و گوشت مخلوط نمایید. از مایه گوشت، کوفته ریزه هایی درست کنید و آنها را در روغن سرخ نمایید. روی کوفته ریزه ها کمی دارچین بپاشید و آن ها را به آلبالوی شیرین شده اضافه نمایید و چند دقیقه بجوشانید." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "برنج را آبکش کنید و کمی زنده تر بردارید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "قابلمه مناسبی را انتخاب کنید و پس از ریختن مقداری روغن، کف آن را با برش های سیب زمینی یا نان بپوشانید." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "برای تهیه آلبالو پلو، مواد تشکیل دهنده باید بصورت لایه هایی متوالی درون قابلمه اضافه شوند. به این ترتیب که ابتداچند کفگیر برنج داخل قابلمه بریزید و پس از ریختن مقداری زعفران، مقداری مایه آلبالو و کوفته ریزه روی برنج اضافه نمایید. لایه های برنج، زعفران و مایه آلبالو را تا تمام شدن کلیه مواد ادامه دهید." +
            "<br>" +
            "<b class='text-danger'> گام ششم: </b>" +
            "چند قاشق شربت روی برنج بریزید و سپس قابلمه را روی حرارت قرار دهید. پس از بخار آمدن برنج، شعله را ملایم نمایید و برنج را حدود سه ربع ساعت دم کنید." +
            "<br>" +
            "<b class='text-danger'> گام هفتم: </b>" +
            "پس از دم شدن، کمی کره آب شده روی آلبالو پلو بریزید و آن را با خلال بادام و پسته تزيین نمایید." +
            "<br>" +
            "امیدوارم از تهیه آلبالو پلو لذت برده باشید."
        },
        {
            "ID": "10",
            "name": "لوبیا پلو",
            "shortDescription": "لوبیا پلو یکی از غذاهای محبوب و غیر رسمی ایرانی است که بسیار پرطرفدار می باشد. لوبیا پلو را معمولا برای مجالس رسمی تهیه نمی کنند بلکه از آن برای وعده های غذایی روزانه استفاده می نمایند. در تهیه لوبیا پلو بهتر است از لوبیا سبز نازک و تازه استفاده شود. برای بهتر شدن ظاهر لوبیا پلو بهتر است لوبیاها را بصورت اریب و دو سانتیمتری خرد کنید. استفاده از دارچی و زعفران دم کرده عطر مطبوعی به لوبیا پلو می دهد." +
            "لوبیا پلو اصالتا با گوشت قرمز تهیه می شود اما بعضی افراد ترجیح می دهند آن را با گوشت مرغ یا گوشت چرخ کرده نیز تهیه کنند. لوبیا پلو معمولا با ماست و خیار و سالاد شیرازی سرو می شود. در ادامه با طرز تهیه لوبیا پلو آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> برنج </li><li> ۵ پیمانه </li>" +
            "<li> گوشت بدون استخوان </li><li> ۵۰۰ گرم </li>" +
            "<li> پیاز سرخ شده </li><li> ۳ عدد </li>" +
            "<li> روغن </li><li> یک دوم پیمانه </li>" +
            "<li> لوبیا سبز </li><li> ۵۰۰ گرم </li>" +
            "<li> رب گوجه فرنگی </li><li> ۳ قاشق سوپخوری </li>" +
            "<li> زعفران دم کرده </li><li> ۳ قاشق سوپخوری </li>" +
            "<li> زردچوبه </li><li> به میزان لازم </li>" +
            "<li> ادویه پلویی </li><li> ۱ قاشق سوپخوری </li>" +
            "<li> کره </li><li> ۵۰ گرم </li>" +
            "</ul>",
            "images": [
                "10-1.jpg",
                "10-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "برنج را از یک روز قبل به همراه مقداری نمک خیس کنید." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "ابتدا پیاز ها را بصورت نگینی خرد کنید و در کمی روغن تفت دهید. سپس گوشت را بصورت قیمه ای خرد کنید و داخل تابه به همراه پیاز تفت دهید. پس از اضافه کردن زردچوبه، مقداری آب گرم در تابه بریزید و بگذارید به جوش بیاید. سپس درب ظرف را بگذارید و اجازه دهید تا گوشت در حرارت کم بپزد و آب آن چیده شود." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "رب گوجه را در کمی روغن تفت دهید و مایه گوشتی را به آن بیافزایید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "دو سر لوبیا سبز ها را بگیرید و آنها را به اندازه های ۱ الی ۲ سانتیمتری خرد نمایید." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "قابلمه ای مناسب انتخاب کنید و مقداری آب در آن بریزید تا جوش بیاید. سپس لوبیاها را به مدت ۱۰ دقیقه در آب بجوشانید و بعد در صافی بریزید و بلافاصله روی آن مقداری آب سرد بریزید." +
            "<br>" +
            "<b class='text-danger'> گام ششم: </b>" +
            "لوبیا ها را در کمی روغن تفت دهید و به مایه گوشتی اضافه نمایید." +
            "<br>" +
            "<b class='text-danger'> گام هفتم: </b>" +
            "برنج را آبکش کنید. سپس در قابلمه ای مناسب، کمی روغن بریزید و کف آن سیب زمینی حلقه شده یا نان لواش بچینید." +
            "<br>" +
            "<b class='text-danger'> گام هشتم: </b>" +
            "برای تهیه لوبیا پلو، مواد تشکیل دهنده باید بصورت لایه های متوالی داخل قابلمه اضافه شوند. به این ترتیب که ابتداچند کفگیر برنج داخل قابلمه بریزید و سپس مقداری مایه گوشت و لوبیا روی آن اضافه کنید و در نهایت ادویه پلویی و کمی دارچین و در آخر زعفران را روی آن بریزید. این فرآیند را آنقدر ادامه دهید تا مواد شما تمام شود." +
            "<br>" +
            "<b class='text-danger'> گام نهم: </b>" +
            "قابلمه محتوی لوبیا پلو را روی حرارت قرار دهید تا بخار کند. سپس یک دمکنی روی آن بگذارید و برنج را به مدت ۱ ساعت دم کنید." +
            "<br>" +
            "<b class='text-danger'> گام دهم: </b>" +
            "هنگام سرو، کمی کره آب کرده روی پلو بریزید و لوبیا پلو را درون ظرفی مناسب و زیبا سرو نمایید." +
            "<br>" +
            "امیدوارم از تهیه لوبیا پلو لذت برده باشید."
        },
        {
            "ID": "11",
            "name": "خوراک زبان با سس قارچ",
            "shortDescription": "خوراک زبان یکی از غذاهای اصیل ایرانی است. این خوراک را می توانید با سس گوجه و قارچ یا سس سفید سرو نمایید. خوراک زبان را معمولا در مجالس و ضیافت های مهم سرو می کنند. در ادامه با طرز تهیه خوراک زبان آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> زبان گوساله </li><li> ۱ عدد </li>" +
            "<li> قارچ </li><li> ۳۰۰ گرم </li>" +
            "<li> پیاز </li><li>۲ عدد</li>" +
            "<li> برگ بو\t </li><li> ۲ الی ۳ برگ </li>" +
            "<li> سبزیجات معطر </li><li> مقداری </li>" +
            "<li> سرکه </li><li> یک و نیم قاشق سوپخوری </li>" +
            "<li> سیر </li><li> ۲ الی ۳ حبه </li>" +
            "<li> رب گوجه فرنگی </li><li> ۳ الی ۴ قاشق سوپخوری </li>" +
            "</ul>",
            "images": [
                "11-1.jpg",
                "11-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "زبان گوساله را با چاقوی تیز، تمیز کنید و رگ و بافت های زائد آن را بگیرید. سپس زبان را بشویید و درون قابلمه مناسبی قرار دهید." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "سبزیجات معطر، برگ بو، پیاز خرد شده، سرکه و سیر را درون قابلمه بریزید. سپس روی مواد آب بریزید و به مدت ۳ الی ۴ ساعت بپزید." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "بعد از پخت، پوست زبان را جدا کنید و با چاقویی تیز، اسلایس های منظمی ایجاد کنید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "قارچ را بشویید، خرد کنید و با مقداری کره تفت دهید تا آب قارچ چیده شود." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "رب گوجه فرنگی را در تابه ای دیگر با کمی روغن زیتون تفت دهید و سپس قارچ های تفت داده شده را به آن اضافه نمایید. مابقی آب زبان (یک دوم پیمانه) را به همراه نمک و فلفل به تابه اضافه کنید و بگذارید سس به غلظت مناسب برسد." +
            "<br>" +
            "<b class='text-danger'> گام ششم:</b>" +
            "برای تهیه این کوفته می توانید بجای گوشت از مرغ چرخ شده نیز استفاده نماییخوراک زبان آماده است. اسلایس های زبان را در ظرفی زیبا به درازا بچینید و پس از ریختن سس قارچ را روی آن، سرو نمایید." +
            "<br>" +
            "امیدوارم از تهیه خوراک زبان با سس قارچ لذت برده باشید."
        },
        {
            "ID": "12",
            "name": "قیمه نثار",
            "shortDescription": "قیمه نثار یکی از غذاهای پرطرفدار سنتی ایرانی است. قیمه نثار از غذاهای سنتی قزوین است که مراسم ها، آیین ها و مراسم عروسی استفاده می شود. در قزوین برای تهیه قیمه نثار از ادویه مخصوص قیمه نثار استفاده می شود. این قیمه را معمولا با سبزی خوردن، سالاد و دوغ مصرف می کنند. در ادامه با طرز تهیه قیمه نثار آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> برنج </li><li> ۵ پیمانه </li>" +
            "<li> گوشت خورش </li><li> ۵۰۰ گرم </li>" +
            "<li> خلال پوست پرتقال </li><li> یک دوم پیمانه </li>" +
            "<li> خلال پوست نارنج </li><li> یک دوم پیمانه </li>" +
            "<li> خلال بادام </li><li> یک چهارم پیمانه </li>" +
            "<li>خلال پسته</li><li> یک چهارم پیمانه </li>" +
            "<li>زعفران دم کرده </li><li> یک چهارم پیمانه </li>" +
            "<li>زرشک</li><li> یک چهارم پیمانه </li>" +
            "<li> گلاب </li><li> یک قاشق چایخوری </li>" +
            "<li> دارچین </li><li> یک قاشق چایخوری </li>" +
            "<li> کره </li><li> ۵۰ گرم </li>" +
            "<li> هل </li><li> یک قاشق چایخوری </li>" +
            "<li> شکر </li><li> ۱ قاشق سوپخوری </li>" +
            "<li> رب گوجه فرنگی </li><li> ۲ قاشق سوپخوری </li>" +
            "</ul>",
            "images": [
                "12-1.jpg",
                "12-2.jpg"
            ],
            "howTo":
            "<b class='text-danger'> گام اول: </b>" +
            "پس از پخت برنج، پیاز را بصورت ریز خرد کنید و تفت دهید. سپس گوشت خرد شده را اضافه کرده و تفت دهید. پس از اضافه کردن زردچوبه و رب گوجه فرنگی و تفت دادن آنها، مقداری آب داخل قابلمه بریزید. گوشت باید روی حرارت بماند تا کاملا پخته شود." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "در اواخر پخت، نمک، دارچین، زعفران، هل، گلاب و آبلیمو را نیز اضافه نمایید." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "در یک تابه کوچک مقداری کره را ذوب کنید و خلال پوست پرتقال شیرین شده، خلال پوست نارنج شیرین شده، خلال بادام، زعفران دم کرده، گلاب و شکر را در آن کمی تفت دهید. مواد را از روی حرارت بردارید و سپس خلال پسته را اضافه کنید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "مقداری از برنج پخته را با زعفران دم کرده مخلوط کنید و کلیه مواد بالا را به آن اضافه نمایید. قیمه نثار آماده است. آن را در ظرفی مناسب و زیبا سرو نمایید." +
            "<br>" +
            "امیدوارم از تهیه قیمه نثار لذت برده باشید."
        },
        {
            "ID": "13",
            "name": "شله مشهدی",
            "shortDescription": "یکی از آش های سنتی ایرانی شله مشهدی است که در مشهد به شله معروف است. شله مشهدی بسیار پر طرفدار و مورد پسند مناطق مختلف کشور می باشد. مردم مشهد شله مشهدی را معمولا در سوگواری ها و آیین های مذهبی استفاده می کنند. این آش از حبوبات، گوشت وادویه فراوان تهیه می شود. برای لذیذ تر شدن این آش بهتر است که از قلم گوساله نیز استفاده شود. در ادامه با طرز تهیه شله مشهدی آشنا می شوید.",
            "ingredients": "<ul>" +
            "<li> گوشت راسته گوسفندی </li><li> ۲ کیلو </li>" +
            "<li> قلم گاو </li><li> ۲ عدد </li>" +
            "<li> دنبه چرخ شده گوسفندی </li><li> ۴۰۰ گرم </li>" +
            "<li> لوبیا قرمز </li><li> ۲ پیمانه </li>" +
            "<li> لوبیا رشتی </li><li> ۲ پیمانه </li>" +
            "<li> لوبیا چیتی </li><li> ۲ پیمانه </li>" +
            "<li> نخود </li><li> ۲ پیمانه </li>" +
            "<li> ماش </li><li> ۲ پیمانه </li>" +
            "<li> بلغور گندم </li><li> ۴ پیمانه </li>" +
            "<li> برنج نیمه دانه </li><li> ۴ پیمانه </li>" +
            "<li> نمک و فلفل سیاه </li><li> به میزان لازم </li>" +
            "<li> دارچین، میخک و زنجبیل </li><li> به میزان لازم </li>" +
            "<li> پودر جوز هندی </li><li> یک قاشق چایخوری </li>" +
            "</ul>",
            "images": [
                "13-1.jpg",
                "13-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "ابتدا تمام حبوبات را پاک کنید، بشویید و به مدت ۲۴ ساعت خیس کنید. بعد نخود و لوبیای خیس شده را جداگانه بپزید و پس از پختن، آن ها را در صافی بریزید تا آب آن گرفته شود." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "در ظرفی مناسب، گوشت، آب قلم و پیاز خرد شده را بریزید و همراه با آب روی حرارت قرار دهید تا کاملا پخته شود." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "بعد گوشت ها را خارج کنید و آن ها را ریش ریش نمایید. سپس بقیه حبوبات را درون ظرف بریزید و مرتب هم بزنید تا مواد کاملا له شده و به شکل حلیم در بیاید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "در اواسطه پخت، ادویه ها را تفت دهید و همراه با دنبه چرخ شده به مواد اضافه نمایید. مخلوط را مرتب هم بزنید تا کلیه مواد خوب یکدست و له شوند. در آخر آن را دم کنید." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "گوشت ریش ریش شده را باید در مرحله آخر به شله اضافه نمایید." +
            "<br>" +
            "<b class='text-danger'> گام ششم: </b>" +
            "زمان پخت این غذا ۸ الی ۹ ساعت می باشد. به خاطر داشته باشید که شله باید مرتبا هم زده شود تا کاملا کش دار و حلیم مانند شود." +
            "<br>" +
            "امیدوارم از تهیه شله مشهدی لذت برده باشید."
        },
        {
            "ID": "14",
            "name": "خورش به آلو",
            "shortDescription": "خورش به آلو یکی از خورش های قدیمی ایرانی است. این خورش بدلیل وجود به دارای طعمی ملس و کمی متفاوت از سایر خورش هاست. طرز تهیه خورش به آلو را در ادامه بخوانید",
            "ingredients": "<ul>" +
            "<li> گوشت مغز ران </li><li >۵۰۰ گرم</li>" +
            "<li> پیاز </li><li >۲ عدد</li>" +
            "<li> به </li><li > ۳۰۰ گرم </li>" +
            "<li> روغن </li><li >یک چهارم پیمانه</li>" +
            "<li> رب گوجه</li><li > ۲ قاشق سوپخوری</li>" +
            "<li> آلو بخارا </li><li > ۲۵۰ گرم</li>" +
            "<li> شکر </li><li > ۱ قاشق سوپخوری</li>" +
            "<li> آبلیمو</li><li > ۲ قاشق سوپخوری</li>" +
            "<li> زعفران دمکرده </li><li >۲ قاشق سوپخوری </li>" +
            "<li> نمک، زرد چوبه </li><li > به میزان لازم </li>" +
            "</ul>",
            "images": [
                "14-1.jpg",
                "14-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "ابتدا گوشت را به صورت قطعاتی درشت خرد کنید." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "پیاز های ریز شده را در ظرفی مناسب سرخ نمایید. سپس زردچوبه را به آن بیافزایید و گوشت را اضافه نمایید." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "مخلوط را آنقدر تفت دهید تا آب گوشت چیده شود. سپس به آن مقداری آب بیافزایید و پس از جوش آمدن، حرارت را کم کنید و در حالی که درب ظرف بسته است بپزید." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "رب تفت داده را به همراه زعفران به خورش اضافه نمایید." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "به را پوست بگیرید و بصورت چهار قاچ خرد کنید. پس از خارج کردن دانه های به، آن را به صورت قطعات منظم خرد نمایید و پس از تفت دادن به خورش اضافه کنید. آلو ها را نیز باید در این مرحله به خورش اضافه کنید. به خاطر داشته باشید که آلو ها را باید یک ساعت قبل از مصرف خیس کرده باشید." +
            "<br>" +
            "<b class='text-danger'> گام ششم: </b>" +
            "می توانید به میزان دلخواه از شکر و آبلیمو استفاده کنید. خورش به آلو را در ظرفی زیبا با چلو سرو نمایید." +
            "<br>" +
            "امیدوارم از تجربه تهیه خورش به آلو لذت برده باشید."
        },
        {
            "ID": "15",
            "name": "کوفته هویج",
            "shortDescription": "در ایران کوفته یکی از غذاهای پرطرفدار و محبوب مردم به حساب می آید. کوفته هویج یکی از این کوفته هاست. کوفته هویج از ترکیب گوشت چرخ کرده، هویج فرنگی و تخم مرغ تهیه می شود. کوفته هویج را می توان در وعده های اصلی ناهار یا شام استفاده نمود. در ادامه با طرز تهیه کوفته هویج آشنا خواهید شد.",
            "ingredients": "<ul>" +
            "<li> گوشت دوبار چرخ شده </li><li >۳۵۰ گرم </li>" +
            "<li> هویج فرنگی </li><li >۲۰۰ گرم</li>" +
            "<li> آرد نخودچی </li><li > ۳ قاشق سوپخوری </li>" +
            "<li> تخم مرغ </li><li >۱ عدد</li>" +
            "<li> پیاز رنده و آبگرفته شده </li><li >۱ عدد </li>" +
            "<li> زعفران دم کرده </li><li >۱ قاشق سوپخوری</li>" +
            "<li> ادویه، زردچوبه و نمک </li><li > به میزان لازم </li>" +
            "<li> جعفری خرده شده یا\t </li><li >یک چهارم پیمانه</li>" +
            "<li> سبزیجات معطر خرد شده </li><li > به میزان لازم </li>" +
            "<li> آبلیمو </li><li > به میزان لازم </li>" +
            "<li> رب گوجه فرنگی </li><li >به میزان لازم</li>" +
            "<li> پیاز نگینی خرد شده\t </li><li > ۱ عدد </li>" +
            "<li> شکر </li><li > به دلخواه </li>" +
            "</ul>",
            "images": [
                "15-1.jpg",
                "15-2.jpg"
            ],
            "howTo": "<b class='text-danger'> گام اول: </b>" +
            "گوشت دوبار چرخ شده را با هویج رنده شده، پیاز رنده شده و آبگرفته، سبزی خرد شده، نمک، فلفل، ادویه، ۱ الی ۲ قاشق آرد سوخاری و ۱ عدد تخم مرغ مخلوط کنید و خوب ورز دهید." +
            "<br>" +
            "<b class='text-danger'> گام دوم: </b>" +
            "از مواد کوفته به اندازه یک نارنگی بردارید و آن را بصورت کروی حالت دهید. درون آن را با گردوی خرد شده، کشمش و پیاز سرخ شده پر کنید و مجددا کوفته را با دستان خود بصورت گرد حالت دهید." +
            "<br>" +
            "<b class='text-danger'> گام سوم: </b>" +
            "کوفته ها را درون روغن قرار دهید تا اطراف آن سرخ شود." +
            "<br>" +
            "<b class='text-danger'> گام چهارم: </b>" +
            "در این مرحله باید سس کوفته را آماده کنید. پیاز نگینی خرد شده را درون روغن تفت دهید و سپس رب گوجه فرنگی را اضافه نموده و مجددا تفت دهید. نمک، ادویه، زردچوبه را به همراه مقداری آب به مواد سس اضافه کنید و بگذارید تا جوش بیاید." +
            "<br>" +
            "<b class='text-danger'> گام پنجم: </b>" +
            "کوفته ها را به آرامی درون سس جوشان قرار دهید و آنها را با درب نیمه باز و حرارت ملایم به مدت یکساعت بپزید تا سس کوفته هویج غلیظ شود. کوفته ها را درون ظرفی زیبا به همراه سس آن سرو نمایید." +
            "<br>" +
            "<b class='text-danger'> نکته: </b>" +
            "برای تهیه این کوفته می توانید بجای گوشت از مرغ چرخ شده نیز استفاده نمایید." +
            "<br>" +
            "همچنین می توانید کوفته هویج را بدون سبزی خرد شده نیز تهیه نمایید." +
            "<br>" +
            "امیدوارم از تهیه کوفته هویج لذت برده باشید."
        }/*,
 {
"ID":"8",
"name":"",
"shortDescription":"",
"ingredients":"",
"images": [
"2-1.jpg",
"2-2.jpg"
 ],
"howTo":""
 }*/
    ]
};


function getCookie(cname) {
    var name = cname + "=";
    var ca = document.cookie.split(";");
    for (var i = 0; i < ca.length; i++) {
        var c = ca[i];
        while (c.charAt(0) == "") {
            c = c.substring(1)
        }
        if (c.indexOf(name) == 0) {
            return c.substring(name.length, c.length)
        }
    }
    return ""
}

function setCookie(cname, cvalue, days) {
    var d = new Date;
    d.setTime(d.getTime() + days * 24 * 60 * 60 * 1e3);
    var expires = "expires=" + d.toUTCString();
    document.cookie = cname + "=" + cvalue + ";" + expires + ";path=/"
}

function isPhoneNumber(inputTXT) {
    var phoneNo = /^(09)\d{9}$/;
    if (inputTXT.match(phoneNo)) {
        return true
    } else {
        return false
    }
}

/*
var correctSound = new Audio("assets/sound/correct1.mp3");
var wrongSound = new Audio("assets/sound/wrong1.mp3");*/

var storage = window.localStorage;
var userDATA = '';
if (typeof Storage !== "undefined") {
    userDATA = storage.getItem("userDATA")
}
var app = angular.module("appApplication", []).controller("appCTRL", ["$scope", "$sce", function ($scope, $sce) {
    $scope.afterReload = function () {
        if (!$scope.$$phase) {
            $scope.$apply()
        }
        /*
        $('[data-toggle="tooltip"]').tooltip();
        $('[data-toggle="popover"].popover()*/
    };
    /* $scope.playSound = function (state) {
    if (state === true) correctSound.play();
    else wrongSound.play()
    };*/
    /*$scope.functionData = jQuery.parseJSON(message);*/

    $scope.foodDATA = null;
    $scope.favoriteList = [];
    if (typeof Storage !== "undefined") {
        $scope.favoriteList = storage.getItem("favoriteList");
        if (!$scope.favoriteList)
            $scope.favoriteList = [];
        else
            $scope.favoriteList = $scope.favoriteList.split(',');
    }
//get data
    $scope.foodDATA = Data;

    $scope.currentContent = $scope.foodDATA.item[0];
    /*$scope.afterReload();*/
    $scope.foodDATA.item.forEach(function (item, index) {
        $scope.foodDATA.item[index].ingredients = $sce.trustAsHtml(item.ingredients);
        $scope.foodDATA.item[index].howTo = $sce.trustAsHtml(item.howTo);
        $scope.foodDATA.item[index].favorite = ($scope.favoriteList.indexOf(item.ID) > -1);
    });
    console.log($scope.foodDATA);
    $scope.afterReload();
    $scope.showContent = function (key) {
        $scope.currentContent = $scope.foodDATA.item[key];
        $.mobile.changePage($("#showContent"), "none");
    };

    $scope.changeFavorite = function () {
        if ($scope.favoriteList.indexOf($scope.currentContent.ID) !== -1)
            $scope.favoriteList.splice($scope.favoriteList.indexOf($scope.currentContent.ID), 1);
        else
            $scope.favoriteList.push($scope.currentContent.ID);
        storage.setItem('favoriteList', $scope.favoriteList);
        console.log($scope.favoriteList);
        $scope.foodDATA.item.forEach(function (item, index) {
            if (item === $scope.currentContent)
                $scope.foodDATA.item[index].favorite = !$scope.foodDATA.item[index].favorite;
        });
    }
}]);